MusicApp/app/controllers/albums_controller.rb

    def show
        @album = Album.where(id: params[:id]).includes(:tracks).first
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 ORDER BY "albums"."id" ASC LIMIT $2  [["id", 14], ["LIMIT", 1]]
SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1  [["album_id", 14]]

    def create
        @album = Album.new(album_params)
        if @album.save
---
INSERT INTO "albums" ("band_id", "title", "year", "studio", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["band_id", 40], ["title", "test"], ["year", 1973], ["studio", false], ["created_at", "2020-08-18 20:28:45.880667"], ["updated_at", "2020-08-18 20:28:45.880667"]]

    def update
        @album = Album.find(params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]