MusicApp/app/controllers/notes_controller.rb

INSERT INTO "notes" ("user_id", "track_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["track_id", 11], ["body", "I love this song!"], ["created_at", "2020-08-19 05:01:02.349498"], ["updated_at", "2020-08-19 05:01:02.349498"]]
---
    def create
        @note = Note.new(note_params)
        @note.user_id = current_user.id
        @note.save

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "notes" SET "body" = $1, "updated_at" = $2 WHERE "notes"."id" = $3  [["body", "That's cool!!!!"], ["updated_at", "2020-08-19 04:52:07.630396"], ["id", 1]]
---
    def update
        @note = Note.find(params[:id])
        if @note.update(note_params)