MusicApp/app/controllers/tracks_controller.rb

INSERT INTO "tracks" ("album_id", "title", "ord", "lyrics", "bonus", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @track = Track.new(track_params)
        if @track.save

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 ORDER BY "tracks"."id" ASC LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1  [["id", 41]]
---
    def show
        @track = Track.where(id: params[:id]).includes(:band).first

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "tracks" SET "youtube" = $1, "updated_at" = $2 WHERE "tracks"."id" = $3  [["youtube", ""], ["updated_at", "2020-08-19 03:27:41.335356"], ["id", 10]]
---
    def update
        @track = Track.find(params[:id])
        if @track.update(track_params)

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 1]]
---
    def destroy
        @track = Track.find(params[:id])
        @track.destroy