MusicApp/app/views/tracks/_form.html.erb

SELECT "albums".* FROM "albums"
---
        <td><select name="track[album_id]" id="album">
            <% Album.all.each do |album| %>