MusicApp/app/views/notes/_note.html.erb

SELECT "notes".* FROM "notes" WHERE "notes"."track_id" = $1  [["track_id", 10]]
---
<ul>
        <% @track.notes.each do |note| %>