MusicApp/app/views/albums/show.html.erb

SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1 ORDER BY "tracks"."ord" ASC  [["album_id", 14]]
---
    Tracks:
    <% tracks = @album.tracks.order(:ord) %>